# המילה global בתוך פונקציה בפייתון משמשת כדי להכריז שמשתנה הוא משתנה גלובלי,
# כלומר משתנה שמוגדר מחוץ לפונקציה וניתן לשנות את ערכו בתוך הפונקציה

# החסרונות בשימוש ב- global:
"""
קושי במעקב ובניפוי שגיאות:
כאשר פונקציות משנות משתנים גלובליים, זה יכול להוביל להתנהגויות בלתי צפויות בקוד, מה שמקשה על המעקב והבנת הקוד.
פגיעה ביכולת התחזוקה:
כאשר פונקציות תלויות במשתנים גלובליים, קשה יותר לשנות את הקוד ולהוסיף פונקציות חדשות מבלי להשפיע על הקוד הקיים.
פגיעה בקריאות הקוד:
קוד שמשתמש במשתנים גלובליים יכול להיות פחות קריא ופחות מובן, מכיוון שהשפעת הפונקציות על המשתנים אינה ברורה מיידית.
פגיעה ביכולת הבדיקה:
קשה יותר לבדוק פונקציות שמשנות משתנים גלובליים, מכיוון שהן עשויות לשנות את מצב התוכנית באופן שלא ניתן לצפות מראש.
*** From chat gpt ***
"""

"""    
x: int = 1
    def foo():
        print(x)
        x = 4
    foo()
"""
# מכיוון שמנסים להדפיס את x לפני שהוא מקבל ערך בתוך הפונקציה, מתקבלת השגיאה

# אם רוצים להשתמש במשתנה x הגלובלי בתוך הפונקציה ולהדפיס אותו, יש להשתמש במילת המפתח global:
x: int = 1
def foo():
    global x
    print(x)
    x = 4
foo()
